yashagarwal-314/Blue_Wedge/MC_FOC_DYNO_SAMe54_MCLV48V300W/src/config/default/X2CCode/X2CModel/Controller/Common/Target.h
/**
 * @file
 * @brief Common includes, macros and type definitions.
 */
/*
 * Copyright (c) 2013, Linz Center of Mechatronics GmbH (LCM) http://www.lcm.at/
 * All rights reserved.
 */
/*
 * This file is licensed according to the BSD 3-clause license as follows:
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the "Linz Center of Mechatronics GmbH" and "LCM" nor
 *       the names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL "Linz Center of Mechatronics GmbH" BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*
 * This file is part of X2C. http://x2c.lcm.at/
 * $LastChangedRevision: 2912 $
 * $LastChangedDate:: 2023-08-24 17:57:58 +0200#$
 */
#ifndef TARGET_H
#define TARGET_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__GENERIC_TI_C28X__)
#define __GENERIC_DEVICE_TYPE__
#define __DATA_WIDTH_16BIT__
#define __ADDRESS_WIDTH_32BIT__

#elif defined(__GENERIC_ARM_ARMV7__) || defined(__GENERIC_ARM_ARMV6__) || defined(__GENERIC_MICROCHIP_PIC32__)
#define __GENERIC_DEVICE_TYPE__
#define __DATA_WIDTH_8BIT__
#define __ADDRESS_WIDTH_32BIT__

#elif defined(__GENERIC_MICROCHIP_DSPIC__) || defined(__GENERIC_MICROCHIP_PIC24__)
#define __GENERIC_DEVICE_TYPE__
#define __DATA_WIDTH_8BIT__
#define __ADDRESS_WIDTH_16BIT__

#elif defined(__GENERIC_X86__)
#define __GENERIC_DEVICE_TYPE__
#define __DATA_WIDTH_8BIT__
#define __ADDRESS_WIDTH_32BIT__

#endif

#if defined(__GENERIC_DEVICE_TYPE__)
#if defined(__CUSTOM_DATATYPE_DEFINITIONS__)
#include "X2cDataTypes.h"
#else
#include <stdint.h>
#include <stdbool.h>    /* support for boolean datatype */
#include <string.h>     /* support for memcpy among other commands */
#if defined(__GENERIC_TI_C28X__)
typedef unsigned char uint8;
typedef signed char int8;
#else
typedef int8_t int8;
typedef uint8_t uint8;
#endif
typedef int16_t int16;
typedef uint16_t uint16;
typedef int32_t int32;
typedef uint32_t uint32;
typedef int64_t int64;
typedef uint64_t uint64;
typedef float float32;
/* most compilers define long double as 64-bit float implementation */
typedef long double float64;
#endif
#endif


#if !defined(__GENERIC_DEVICE_TYPE__)

/* processor types */
/* TI processors */
#if defined(__TMS320F28069__)
#define __TMS320F2806X__
#elif defined(__TMS320F28035__) || defined(__TMS320F28034__)
#define __TMS320F2803X__
#elif defined(__TMS320F28027__)
#define __TMS320F2802X__
#elif defined(__TMS320F28335__)
#define __TMS320F2833X__
#elif defined(__TMS320F2808__)
#define __TMS320F280X__
#elif defined(__TMS320F2811__)
#define __TMS320F281X__
#elif defined(__TM4C123GH6__) || defined(__TM4C123BE6__) || defined(__TM4C1294NC__)
#define __SERIES_TM4C__
#elif defined(X2C_TMS320F28379D)
#define X2C_SERIES_TMS32F2837X
#elif defined(X2C_TMS320F280039) || defined(X2C_TMS320F280037)
#define X2C_SERIES_TMS320F28003X
#elif defined(X2C_TMS320F280049) || defined(X2C_TMS320F280041)
#define X2C_SERIES_TMS320F28004X
#elif defined(X2C_TMS320F2800137)
#define X2C_SERIES_TMS320F280013X
#elif defined(X2C_TMS320F28388D) || defined(X2C_TMS320F28386D)
#define X2C_SERIES_TMS320F2838X

/* ST processors */
#elif defined(__STM32F103ZC__) || defined(__STM32F103T6__) || defined(__STM32F103VB__) || defined(__STM32F103V8__) || \
defined(__STM32F100C6__) || defined(__STM32F103RB__) || defined(X2C_STM32F103RB)
#define __SERIES_STM32F1__
#elif defined(__STM32F407ZG__) || defined(__STM32F407ZE__) || defined(__STM32F407VG__) || defined(X2C_STM32F446VE) || defined(X2C_STM32F446RE) || \
    defined(X2C_STM32F407VE)
#define __SERIES_STM32F4__
#define X2C_SERIES_STM32F4
#elif defined(__STM32F051R8__) || defined(__STM32F051C8__) || defined(X2C_STM32F072RB)
#define __SERIES_STM32F0__
#elif defined(__STM32F303RE__) || defined(__STM32F303RB__) || defined(__STM32F302RD__) || defined(X2C_STM32F302R8)
#define __SERIES_STM32F3__
#elif defined(X2C_STM32G0B1RE) || defined(X2C_STM32G0B1RB)
#define X2C_SERIES_STM32G0
#elif defined(X2C_STM32G474RE) || defined(X2C_STM32G474RB) || defined(X2C_STM32G474ME)
#define X2C_SERIES_STM32G4

/* Renesas processors */
#elif defined(__RX62T__) || defined(__R5F562TA__)
#include <iorx62t.h>
#define __RX6XX__
#elif defined(__RX62G__) || defined(__R5F562GA__)
#include <iorx62g.h>
#define __RX6XX__

/* Freescale processors */
#elif defined(__MPC5643L__)
#include <MPC5643L.h>
#define __SERIES_MPC5__

#elif defined(__KECONTROL__)
#define __SERIES_KECONTROL__

#elif defined(X2C_DSPIC33CK256MP505)
#define X2C_SERIES_DSPIC33C
#elif defined(__DSPIC33EP256MC506__) || defined(__DSPIC33EP128GP502__) || defined(__DSPIC33EP32GP502__) || \
defined(__DSPIC33EP256GP502__) || defined(__DSPIC33EP256MC502__) || defined(__DSPIC33EP128MC202__) || \
defined(__DSPIC33EP128GM604__) || defined(X2C_DSPIC33EP512GM604)
#define __SERIES_DSPIC33E__
#elif defined(__DSPIC33FJ12GP202__) || defined(__DSPIC33FJ128MC802__)
#define __SERIES_DSPIC33F__
#elif defined(__PIC32MZ2048EC__)
#define __SERIES_PIC32MZ__
#elif defined(__PIC32MX170F256__)
#define __SERIES_PIC32MX__

#elif defined(__XMC4800F144K2048__) || defined(__XMC4800F100K2048__) || defined(X2C_XMC4800F144K2048) || defined(X2C_XMC4800F100K2048)
#define X2C_SERIES_XMC4800

#elif defined(__XMC4700F144K2048__) || defined(__XMC4700F100K2048__) || defined(X2C_XMC4700F144K2048)
#define X2C_SERIES_XMC4700

#elif defined(__XMC4400F100K512__) || defined(X2C_XMC4400F100K512)
#define X2C_SERIES_XMC4400

#elif defined(__XMC4500F100K1024__) || defined(X2C_XMC4500F100K1024)
#define X2C_SERIES_XMC4500

#elif defined(X2C_TC387QP)
#define X2C_SERIES_TC3XX

#elif defined(MATLAB_MEX_FILE)
#define __MATLAB__

