yashagarwal-314/Blue_Wedge/MC_FOC_DYNO_SAMe54_MCLV48V300W/src/config/default/X2CCode/X2CModel/Controller/Common/Target.h
/* limits for INT16 values */
#ifndef INT16_MAX
#define INT16_MAX ((int16)32767)
#endif
#ifndef INT16_MIN
#define INT16_MIN ((int16)-32768)
#endif
#ifndef UINT16_MAX
#define UINT16_MAX ((uint16)65535)
#endif

/* limits for INT32 values */
#ifndef INT32_MAX
#define INT32_MAX ((int32)2147483647)
#endif
#ifndef INT32_MIN
#define INT32_MIN ((int32)-2147483648)
#endif
#ifndef UINT32_MAX
#define UINT32_MAX ((uint32)4294967295)
#endif

/* limits for INT64 values */
#ifndef INT64_MAX
#define INT64_MAX ((int64)9223372036854775807)
#endif
#ifndef INT64_MIN
#define INT64_MIN ((int64)-9223372036854775808)
#endif
#ifndef UINT64_MAX
#define UINT64_MAX ((uint64)18446744073709551615)
#endif

/* limits for FLOAT32 values */
#ifndef FLOAT32_MAX
#define FLOAT32_MAX	 ((float32)3.4028234663852885981170418348452e+38)
#endif
#ifndef FLOAT32_MIN
#define FLOAT32_MIN	 ((float32)-3.4028234663852885981170418348452e+38)
#endif

/* limits for FLOAT64 values */
#if defined(__COMPILER_TI__)
#ifndef FLOAT64_MAX
#define FLOAT64_MAX	  ((float64)3.4028234663852885981170418348452e+38)
#endif
#ifndef FLOAT64_MIN
#define FLOAT64_MIN	  ((float64)-3.4028234663852885981170418348452e+38)
#endif
#else
#ifndef FLOAT64_MAX
#define FLOAT64_MAX	  ((float64)1.797693134862315708145274237317e+308)
#endif
#ifndef FLOAT64_MIN
#define FLOAT64_MIN	  ((float64)-1.797693134862315708145274237317e+308)
#endif
#endif

/* limits for INT15 values */
#define INT15_MAX ((int16)16383)
#define INT15_MIN ((int16)-16384)

/* limits for INT30 values */
#define INT30_MAX ((int32)536870911)
#define INT30_MIN ((int32)-536870912)
#define UINT30_MAX ((uint32)1073741823)

/* limits for INT31 values */
#define INT31_MAX ((int32)1073741823)
#define INT31_MIN ((int32)-1073741824)
#define UINT31_MAX ((uint32)2147483647)

/* limits for INT63 values */
#define INT63_MAX ((int64)4611686018427387903)
#define INT63_MIN ((int64)-4611686018427387904)

/* floating point constants */
#define PI_R32		((float32)3.1415926535897932384626433832795028841971693993751058209749445923078164062)
#define PI_R64		((float64)3.1415926535897932384626433832795028841971693993751058209749445923078164062)

typedef enum typeclass_t {
	TYPE_INT8,
	TYPE_UINT8,
	TYPE_INT16,
	TYPE_UINT16,
	TYPE_INT32,
	TYPE_UINT32,
	TYPE_INT64,
	TYPE_UINT64,
	TYPE_FLOAT32,
	TYPE_FLOAT64,
	TYPE_BOOL
} TypeClass;

#ifdef __cplusplus
}
#endif

#endif
